/* 推導韻圖擬音（辛克）
 *
 * 《韻圖音系》
 * https://zhuanlan.zhihu.com/p/340778356
 *
 * 《韻圖音系聲韻搭配》
 * https://www.zhihu.com/column/p/475017177
 *
 * 《韻圖音系同音字表》
 * https://docs.qq.com/sheet/DYk9aeldWYXpLZENj
 *
 * @author unt
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  ['部分蟹攝二等入假攝', false],
  ['部分流攝脣音入遇攝', true],
  ['全濁上歸去', true],
  ['完全莊三化二\n僅爲與中唐慧琳反切對齊而設', true],
];

function 調整音韻地位() {
  function 調整(表達式, 調整屬性, 字頭串 = null) {
    if (typeof (字頭串) === 'string' && !字頭串.includes(字頭)) return;
    if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性);
  }

  // [慧琳反切體現的, 唐代用韻體現的, 據今音推測的]
  const 蟹攝二等入假攝字 = ['崖咼(呙)扠涯搋派差絓畫(画)罣罷(罢)', '佳鼃娃解釵(钗)卦柴', '哇洼蛙灑蝸話(话)掛挂查叉杈衩'].join('');
  const 流攝脣音入遇攝字 = ['浮戊母罦罘蜉矛茂覆懋拇某負(负)阜', '謀(谋)部畝(亩)畮婦(妇)不否桴富牟缶', '復複(复)副牡'].join('');
  if (選項.部分蟹攝二等入假攝) 調整('蟹攝 二等', { 韻: '麻' }, 蟹攝二等入假攝字);
  if (選項.部分流攝脣音入遇攝) 調整('幫組 尤侯韻', { 韻: is`尤韻` ? '虞' : '模' }, 流攝脣音入遇攝字);
}

調整音韻地位();

let 聲母 = when([
  ['幫組 C類', { 幫: 'pf', 滂: 'pfʰ', 並: 'bv', 明: 'mv' }[音韻地位.母]],
  ['來母 二三等', 'ɭ'],
  ['常船母 仄聲', 'ʒ'],
  ['', {
    幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
    端: 't', 透: 'tʰ', 定: 'd', 泥: 'n', 來: 'l',
    知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ',
    精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
    莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
    章: 'tʃ', 昌: 'tʃʰ', 常: 'dʒ', 書: 'ʃ', 船: 'dʒ', 日: 'ɲʒ', 以: 'j',
    見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ',
    影: 'ʔ', 曉: 'h', 匣: 'ɦ', 云: '',
  }[音韻地位.母]],
]);

let 等呼idx = '一開|二開|三開|四開|輕脣|一合|二合|三合|四合'
  .split('|')
  .indexOf(when([
    ['幫組 C類', [
      ['蟹咸山攝', '輕脣'],
      ['止攝', '四開'],
      ['', '一合'],
    ]],
    ['', when([
      ['幽韻', '四'],
      [選項.完全莊三化二 === false && '莊組 蟹山咸攝 三等', '四'],
      ['三四'.includes(音韻地位.韻圖等) && '銳音', [
        ['遇通宕攝', '三'],
        ['', '四'],
      ]],
      ['', 音韻地位.韻圖等],
    ]) + when([
      ['遇通攝 或 合口', '合'],
      ['幫組 一二等', '合'],
      ['', '開'],
    ])],
  ]));

let 韻母 = {
  遇: '  |   |   |   |   | u | ʅu|ɨ̯u |   ',
  止: '  | ʅi̯| ɨi̯| i |   |   |ʯᵊi|ɨui| yi̯',
  流: 'əu|ʅᵊu| ɨu̯| iu̯|   |uəu|   |   |   ',
  深: '  |ʅᵊm| ɨm| im|   |   |   |   |   ',
  臻: 'ən|ʅᵊn| ɨn| in|   | un|ʯᵊn|ɨun| yn',
  通: '  |   |   |   |   | uŋ|ʅuŋ|ɨuŋ|   ',
  曾: 'əŋ|ʅᵊŋ| ɨŋ| iŋ|   |uəŋ|   |ʉiŋ|   ',
  果: 'ɑ |   |ɨɔ |   |   |uɔ |   |ʉɔ |   ',
  假: '  |ɯa |ɨa |ia |   |   |ua |ʉɔ |   ',
  蟹: 'ɑi|ɯai|ɨei|iei| ei|uoi|uai|ʉoi|yei',
  效: 'ɑu|ɯau|ɨeu|ieu|   |uɔu|uau|   |   ',
  咸: 'ɑm|ɯam|ɨem|iem|uɐm|uɔm|uam|   |   ',
  山: 'ɑn|ɯan|ɨen|ien|uɐn|uon|uan|ʉon|yen',
  梗: 'ɛŋ|ɯɛŋ|ɨeŋ|ieŋ|   |   |uɛŋ|ʉeŋ|yeŋ',
  江: '  |ɯaŋ|   |   |   |   |uaŋ|   |   ',
  宕: 'ɑŋ|ʅɔŋ|ɨɔŋ|   |   |uɔŋ|   |ʉɔŋ|   ',
}[音韻地位.攝].split('|')[等呼idx].trim();

if (is`入聲`) 韻母 = 韻母
  .replace('m', 'p')
  .replace('n', 't')
  .replace('ŋ', 'k');

if (is`宕攝 A類`) 韻母 = 'iɔŋ';
if (is`來母 果假攝 三等 合口`) 韻母 = 'yɔ';

if (is`莊組`) 韻母 = 韻母.replace(/^i/, 'ʅ').replace(/^y/, 'ʯ');

let 聲調 = '平上去入'.indexOf(when([
  [選項.全濁上歸去 !== false && '全濁 上聲', '去'],
  ['', 音韻地位.聲],
])) + 1;

return 聲母 + 韻母 + 聲調;
