/* 推導韻圖拼音（Sliark）
*
* @author unt
*/

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  ['部分蟹攝二等入假攝', true],
  ['部分流攝脣音入遇攝', true],
  ['完全莊三化二', false],
  ['全濁上歸去', false],
  ['調類數字上標', true],
];

function 調整音韻地位() {
  function 調整(表達式, 調整屬性, 字頭串 = null) {
    if (typeof (字頭串) === 'string' && !字頭串.includes(字頭)) return;
    if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性);
  }

  // 輕唇化例外
  調整('明母 尤韻', { 等: '一', 類: null, 韻: '侯' });
  調整('明母 東韻', { 等: '一', 類: null });

  if (is`云母 通攝 舒聲`) 音韻地位 = 音韻地位.調整('匣母', ['匣母三等']); // 雄熊

  // [慧琳反切體現的, 唐代用韻體現的, 據今音推測的]
  const 蟹攝二等入假攝字 = ['崖咼(呙)扠涯搋派差絓畫(画)罣罷(罢)', '佳鼃娃解釵(钗)卦柴', '哇洼蛙灑蝸話(话)掛挂查叉杈衩'].join('');
  const 流攝脣音入遇攝字 = ['浮戊母罦罘蜉矛茂覆懋拇某負(负)阜', '謀(谋)部畝(亩)畮婦(妇)不否桴富牟缶', '復複(复)副牡'].join('');
  if (選項.部分蟹攝二等入假攝) 調整('蟹攝 二等', { 韻: '麻' }, 蟹攝二等入假攝字);
  if (選項.部分流攝脣音入遇攝) 調整('幫組 尤侯韻', { 韻: is`尤韻` ? '虞' : '模' }, 流攝脣音入遇攝字);
}

調整音韻地位();

let 聲母 = when([
  ['幫組 C類', { 幫: 'f', 滂: 'fh', 並: 'v', 明: 'v' }[音韻地位.母]],
  ['來母 二三等', 'lr'],
  ['', {
    幫: 'p', 滂: 'ph', 並: 'b', 明: 'm',
    端: 't', 透: 'th', 定: 'd', 泥: 'n', 來: 'l',
    知: 'tr', 徹: 'trh', 澄: 'dr', 孃: 'nr',
    精: 'ts', 清: 'tsh', 從: 'dz', 心: 's', 邪: 'z',
    莊: 'tsr', 初: 'tsrh', 崇: 'dzr', 生: 'sr', 俟: 'dzr',
    章: 'tsj', 昌: 'tsjh', 常: 'zj', 書: 'sj', 船: 'zj', 日: 'nj', 以: 'j',
    見: 'k', 溪: 'kh', 羣: 'g', 疑: 'ng',
    影: 'q', 曉: 'h', 匣: 'gh', 云: '',
  }[音韻地位.母]],
]);

let 等 = when([
  ['幫組 C類', '一'],
  [選項.完全莊三化二 && '莊組 蟹山咸梗攝', '二'],
  ['銳音 三四等', '三'],
  ['', 音韻地位.韻圖等],
]);

let 呼 = when([
  ['東韻 三等 或 魚韻', '開'],
  ['通遇攝', '合'],
  [等 === '一' && '臻攝 幫組', '合'],
  ['', 音韻地位.呼 || '開'],
]);

let 介音 = {
  一: { 開: '', 合: 'u' },
  二: { 開: 'e', 合: 'ue' },
  三: { 開: 'i', 合: 'y' },
  四: { 開: 'ji', 合: 'jy' },
}[等][呼];

let 韻母 = {
  止: 'i', 蟹: 'ai',
  遇: 'o', 果: 'a', 假: 'a',
  流: 'ou', 效: 'au',
  臻: 'en', 山: 'an',
  深: 'em', 咸: 'am',
  曾: 'eng', 梗: 'eang',
  通: 'ung', 江: 'eaong', 宕: 'ang',
}[音韻地位.攝];

if (介音) {
  if (!is`曾梗攝`) 韻母 = 韻母.replace('e', '');
  if (is`曾攝 三等`) 韻母 = 韻母.replace('e', 'i');
  if (is`遇攝 非 開口`) 韻母 = 韻母.replace('o', 'u');
}
韻母 = 介音 + 韻母;
韻母 = 韻母
  .replace(/i+/, 'i')
  .replace(/u+/, 'u')
  .replace(/e+/, 'e');

if (is`入聲`) 韻母 = 韻母
  .replace('ng', 'k')
  .replace('n', 't')
  .replace('m', 'p');

let 聲調idx = '平上去入'.indexOf(when([
  [選項.全濁上歸去 === true && '全濁 上聲', '去'],
  ['', 音韻地位.聲],
]));

let 聲調 = 選項.調類數字上標 ? '¹²³⁴'[聲調idx] : 聲調idx + 1;

return 聲母 + 韻母 + 聲調;
